wip/dabbrev/dabbrev.md
- [dabbrev](#org0b82fe7)
- [dabbrev-expand](#org939f2f1)
- [The Meat: dabbrev&#x2013;search](#org638d021)
  - [dabbrev&#x2013;abbrev-char-regexp](#orgd2fd589)
  - [dabbrev-limit](#org2c8743a)
  - [search](#org8cc3c3b)
  - [filter matches](#org8ea7b55)
- [remember the last search](#orga9ad0ae)
- [search from other buffers and friend buffers](#orgf3cc5dc)
- [find all candidates at once.](#org6435527)
  - [completion-in-region](#org5800421)
  - [table lambda:](#orgdc67c0d)
    - [when action is not &rsquo;metadata](#org3c3ae1d)
    - [dabbrev&#x2013;find-all-expansions](#orgb5003af)
    - [complete-with-action](#org986b3fe)

<a id="org0b82fe7"></a>

# dabbrev

[dynamic abbrev](https://git.savannah.gnu.org/cgit/emacs.git/tree/lisp/dabbrev.el?h=fa65c044f2ebe666467166075c1507a8d0e1347f#n429)

<a id="org939f2f1"></a>

# dabbrev-expand

[code](https://git.savannah.gnu.org/cgit/emacs.git/tree/lisp/dabbrev.el?h=fa65c044f2ebe666467166075c1507a8d0e1347f#n429)

```elisp
(defun dabbrev-expand (arg)
  "Expand previous word \"dynamically\".
...""
  (interactive "*P")
...
```

[interactive-codes](https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html)

1.  `*` Signal an error if the current buffer is read only
2.  `P` The raw prefix argument.

<a id="org638d021"></a>

# The Meat: dabbrev&#x2013;search

[link](https://git.savannah.gnu.org/cgit/emacs.git/tree/lisp/dabbrev.el?h=fa65c044f2ebe666467166075c1507a8d0e1347f#n918)

```elisp
(defun dabbrev--search (abbrev reverse ignore-case)
  "Search for something that could be used to expannd ABBREV.

Second arg, REVERSE, is t for reverse search, nil for forward.
The variable `dabbrev-limit' controls the maximum search region size.
Third argument IGNORE-CASE non-nil means treat case as insignificant while
looking for a match and when comparing with previous matches.  Also if
that's non-nil and the match is found at the beginning of a sentence
and is in lower case except for the initial then it is converted to
all lower case for return.

Table of expansions already seen is examined in buffer
`dabbrev--last-table' so that only distinct possibilities are found
by dabbrev-re-expand.

Returns the expansion found, or nil if not found.
Leaves point at the location of the start of the expansion."
  (save-match-data
    (let ((pattern1 (concat (regexp-quote abbrev)
			    "\\(" dabbrev--abbrev-char-regexp "\\)"))
	  (pattern2 (concat (regexp-quote abbrev)
			   "\\(\\(" dabbrev--abbrev-char-regexp "\\)+\\)"))
	  ;; This makes it possible to find matches in minibuffer prompts
	  ;; even when they are "inviolable".
	  (inhibit-point-motion-hooks t)
	  found-string result)
      ;; Limited search.
      (save-restriction
	(and dabbrev-limit
	     (narrow-to-region
              dabbrev--last-expansion-location
              (+ (point) (if reverse (- dabbrev-limit) dabbrev-limit))))
	;;--------------------------------
	;; Look for a distinct expansion, using dabbrev--last-table.
	;;--------------------------------
	(while (and (not found-string)
		    (if reverse
			(re-search-backward pattern1 nil t)
		      (re-search-forward pattern1 nil t)))
	  (goto-char (match-beginning 0))
	  ;; In case we matched in the middle of a word,
	  ;; back up to start of word and verify we still match.
	  (dabbrev--goto-start-of-abbrev)

	  (if (not (looking-at pattern1))
	      nil
	    ;; We have a truly valid match.  Find the end.
	    (re-search-forward pattern2)
	    (setq found-string (match-string-no-properties 0))
	    (setq result found-string)
	    (and ignore-case (setq found-string (downcase found-string)))
	    ;; Ignore this match if it's already in the table.
	    (if (dabbrev-filter-elements
		 table-string dabbrev--last-table
		 (string= found-string table-string))
		(setq found-string nil)))
	  ;; Prepare to continue searching.
	  (goto-char (if reverse (match-beginning 0) (match-end 0))))
	;; If we found something, use it.
	(when found-string
	  ;; Put it into `dabbrev--last-table'
	  ;; and return it (either downcased, or as is).
	  (setq dabbrev--last-table
		(cons found-string dabbrev--last-table))
	  result)))))
```

this is bottom of the call chain, the caller methods above manages last matched buffer, last matched location, case-sensitivity, customizations and many other features.

three args:

1.  abbrev: the substring you just typed for completion.
2.  reverse: t if search backward, nil for forward.
3.  ignore-case: case-sensitivity search or not.

<a id="orgd2fd589"></a>

## dabbrev&#x2013;abbrev-char-regexp

[link](https://ftp.gnu.org/old-gnu/Manuals/emacs-20.7/html_chapter/emacs_28.html)

> The variable dabbrev-abbrev-char-regexp, if non-nil, controls which characters are considered part of a word, for dynamic expansion purposes. The regular expression must match just one character, never two or more. The same regular expression also determines which characters are part of an expansion. The value nil has a special meaning: abbreviations are made of word characters, but expansions are made of word and symbol characters.

- `pattern1` is the abbreb followed by one more allowed char.
- `pattern2` is the abbrev followed by 1 or more allowed chars.

<a id="org2c8743a"></a>

## dabbrev-limit

dabbrev-limit controled the range to search, from current `point` to `(point - dabbrev-limit)` if search backward. Here the library use `save-restriction` and `narrow-to-region` pattern to avoid search beyond the region and later restore the original narrowing.

<a id="org8cc3c3b"></a>

## search

the search is performed by `re-search-forward` or `re-search-backward` with `pattern1`.

1.  goto the beginning of matched string.
2.  back up to the start of the word if necessary.
3.  if the string starting from current point matches `pattern1`.
4.  `(re-search-forward pattern2)` to find the end of the match.
5.  get the string without text properties.

<a id="org8ea7b55"></a>

## filter matches

if the current match was offered before, we don&rsquo;t want to offer it again, b/c we know the user didn&rsquo;t want that match. That&rsquo;s why there is var `dabbrev--last-table` that keeps the previous matches in this matching session.

`dabbrev-filter-elements` is a macro that filters apply `condition` to each `element` in the `list`, and return the matched elements in a list.

the body of the defmacro is straightforward and as expected, it loops the list and keep the rest in `dabbrev-tail`, apply the condition/predicate to the first elements of the list. If truthy, puts at the beginning of `dabbrev-result`, and finally returnsreversed `dabbrev-result`.

```elisp
;; if CONDITION evaluates non-nil.
(defmacro dabbrev-filter-elements (element list condition)
  `(let (dabbrev-result dabbrev-tail ,element)
    (setq dabbrev-tail ,list)
    (while dabbrev-tail
      (setq ,element (car dabbrev-tail))
      (if ,condition
          (setq dabbrev-result (cons ,element dabbrev-result)))
      (setq dabbrev-tail (cdr dabbrev-tail)))
    (nreverse dabbrev-result)))
```

this `dabbrev-filter-elements` returns a non-empty list, i.e. truthy, set found-string to nil and continue the search, otherwise, puts `found-string` into `dabbrev--last-table` for furture filtering.

<a id="orga9ad0ae"></a>

# remember the last search

b/c `dabbrev-expand` offers only one candidate at a time, so to avoid repeated wasted work, it has a few variables that &ldquo;remembers&rdquo; the last matched buffer and location.

- `dabbrev-search-these-buffers-only` controls which buffers is allowed to provide match candidates.
- `dabbrev--last-abbreviation` records last string it tries to expand.
- `dabbrev--last-expansion` records last expansion it offered.
- `dabbrev--last-direction` records the direction last time.

and more [here](https://git.savannah.gnu.org/cgit/emacs.git/tree/lisp/dabbrev.el?h=fa65c044f2ebe666467166075c1507a8d0e1347f#n292) .
