wip/dabbrev/dabbrev.md

<a id="orgf3cc5dc"></a>

# search from other buffers and friend buffers

```elisp
;; The list of remaining buffers with the same mode as current buffer.
(defvar dabbrev--friend-buffer-list nil)

;; The buffer we looked in last, not counting the current buffer.
(defvar dabbrev--last-buffer nil)

;; The buffer we found the expansion last time.
(defvar dabbrev--last-buffer-found nil)
```

`dabbrev-expand` has a few var to remember the last buffer it found the candidate.

if the `dabbrev--last-buffer` is truthy, continue search from that buffer.

in `dabbrev-expand`, it sets `dabbrev--last-buffer-found` for the last buffer where it found the last match.

```elisp
(defun dabbrev-expand (arg)
  "Expand previous word \"dynamically\".
...
		  (if dabbrev--last-buffer
		      (set-buffer dabbrev--last-buffer))
...
      (if (not (or (eq dabbrev--last-buffer dabbrev--last-buffer-found)
		   (minibuffer-window-active-p (selected-window))))
	  (progn
	    (message "Expansion found in `%s'"
		     (buffer-name dabbrev--last-buffer))
	    (setq dabbrev--last-buffer-found dabbrev--last-buffer))

```

in `dabbrev--find-expansion` it contines from the last buffer if `dabbrev--last-buffer` is set.

When current buffer fail to produce a candidate, it creates a `dabbrev--friend-buffer-list` and pop the first one as the `dabbrev--last-buffer`.

```elisp
(defun dabbrev--find-expansion (abbrev direction ignore-case)
...
(save-excursion
    ;; If we were scanning something other than the current buffer,
    ;; continue scanning there.
    (when dabbrev--last-buffer
      (set-buffer dabbrev--last-buffer))
...
(progn
       (setq dabbrev--last-direction -1)
       (unless dabbrev--last-buffer
	 ;; If we have just now begun to search other buffers,
	 ;; determine which other buffers we should check.
	 ;; Put that list in dabbrev--friend-buffer-list.
	 (unless dabbrev--friend-buffer-list
           (setq dabbrev--friend-buffer-list
                 (dabbrev--make-friend-buffer-list))
           (setq dabbrev--progress-reporter
                 (make-progress-reporter
                  "Scanning for dabbrevs..."
                  (- (length dabbrev--friend-buffer-list)) 0 0 1 1.5))))
       ;; Walk through the buffers till we find a match.
       (let (expansion)
	 (while (and (not expansion) dabbrev--friend-buffer-list)
	   (setq dabbrev--last-buffer (pop dabbrev--friend-buffer-list))
	   (set-buffer dabbrev--last-buffer)
           (progress-reporter-update dabbrev--progress-reporter
                                     (- (length dabbrev--friend-buffer-list)))
	   (setq dabbrev--last-expansion-location (point-min))
	   (setq expansion (dabbrev--try-find abbrev nil 1 ignore-case)))
	 (progress-reporter-done dabbrev--progress-reporter)
	 expansion)))))
```

<a id="org6435527"></a>

# find all candidates at once.

dabbrev-expand finds one candidate at a time, user has to cycle through and determine if the offered candidate is the wanted one or try the next. It&rsquo;s sometimes easier to show all the candidates in a minibuffer and continue type to narrow down until just one left. `dabbrev-completion` is for this. [link](https://git.savannah.gnu.org/cgit/emacs.git/tree/lisp/dabbrev.el?h=fa65c044f2ebe666467166075c1507a8d0e1347f#n372).

```elisp
(defun dabbrev-completion (&optional arg)
  "Completion on current word.
Like \\[dabbrev-expand] but finds all expansions in the current buffer
and presents suggestions for completion.

With a prefix argument ARG, it searches all buffers accepted by the
function pointed out by `dabbrev-friend-buffer-function' to find the
completions.

If the prefix argument is 16 (which comes from \\[universal-argument] \\[universal-argument]),
then it searches *all* buffers."
```

dabbrev-completion command body does the following things:

1.  define a `table` var that&rsquo;s a lambda function
2.  setup `dabbrev--check-other-buffers` to t if arg is present
3.  setup `dabbrev--check-all-buffers` to t if arg is numerical and is 16.
4.  call `completion-in-region`.

<a id="org5800421"></a>

## completion-in-region

This function is defined in `minibuffer.el`.

> (completion-in-region START END COLLECTION &optional PREDICATE) Documentation Complete the text between START and END using COLLECTION.
>
> Point needs to be somewhere between START and END. PREDICATE (a function called with no arguments) says when to exit. This calls the function that completion-in-region-function specifies (passing the same four arguments that it received) to do the work, and returns whatever it does. The return value should be nil if there was no valid completion, else t.
>
> [basic completion](https://www.gnu.org/software/emacs/manual/html_node/elisp/Basic-Completion.html): You can also use a function as collection. Then the function is solely responsible for performing completion; try-completion returns whatever this function returns. The function is called with three arguments: string, predicate and nil (the third argument is so that the same function can be used in all-completions and do the appropriate thing in either case). See Programmed Completion.

In this case, the table var is a function. so we know s - string, p - predicate, a - aciton.

<a id="orgdc67c0d"></a>

## table lambda:

```elisp
         (table
          (lambda (s p a)
            (if (eq a 'metadata)
                `(metadata (cycle-sort-function . ,#'identity)
                           (category . dabbrev))
              (when (eq list 'uninitialized)
                (save-excursion
                  ;;--------------------------------
                  ;; New abbreviation to expand.
                  ;;--------------------------------
                  (setq dabbrev--last-abbreviation abbrev)
                  ;; Find all expansion
                  (let ((completion-list
                         (dabbrev--find-all-expansions abbrev ignore-case-p))
                        (completion-ignore-case ignore-case-p))
                    (or (consp completion-list)
                        (user-error "No dynamic expansion for \"%s\" found%s"
                                    abbrev
                                    (if dabbrev--check-other-buffers
                                        "" " in this-buffer")))
                    (setq list
                          (cond
                           ((not (and ignore-case-p dabbrev-case-replace))
                            completion-list)
                           ((string= abbrev (upcase abbrev))
                            (mapcar #'upcase completion-list))
                           ((string= (substring abbrev 0 1)
                                     (upcase (substring abbrev 0 1)))
                            (mapcar #'capitalize completion-list))
                           (t
                            (mapcar #'downcase completion-list)))))))
              (complete-with-action a list s p))))

```

when action is `'metadata`, this is our chance to determine the behavior of the minibuffer candidate:

- `cycle-sort-function` function to sort entries when cycling. i am not 100% sure what this does, and the doc is vague. I guess when user comes to the bottom of the match minibuffer and still tries go down, this function is trigger with the current list and the returned list is used to update the minibuffer content. In our case, it simply goes back to the head of the minibuffer and start again.
- `category` a symbol describing what kind of text the completion function is trying to complete. This category is shown in the minibuffer so you know where this candidate is computed and offered.
- more controls [here](https://www.gnu.org/software/emacs/manual/html_node/elisp/Programmed-Completion.html)

<a id="org3c3ae1d"></a>

### when action is not &rsquo;metadata

we need to do real search and provide a list of candidate for minibuffer.

1.  find candidates

    `dabbrev--find-all-expansions` finds all candidates for user-typed substring `abbrev`.

2.  case handling
