dabbrev/dabbrev.org
**** case handling
the last part of the function handles case to match the user-typed substring case.
- if =dabbrev-case-replace= is falsey or =ignore-case-p= is truthy, return the candidates list as is
- else if user-typed substring is UPCASE, upcase the candidates list
- else if user-typed subsrtring is capitalized, capitalized the candidates list
- else downcase the candidates list.
*** dabbrev--find-all-expansions
#+begin_src elisp
(defun dabbrev--find-all-expansions (abbrev ignore-case)
  "Return a list of all possible expansions of ABBREV.
If IGNORE-CASE is non-nil, accept matches which differ in case."
  (let ((all-expansions nil)
	expansion)
    (save-excursion
      (goto-char (point-min))
      (while (setq expansion (dabbrev--find-expansion abbrev -1 ignore-case))
	(setq all-expansions (cons expansion all-expansions))))
    all-expansions))
#+end_src
go to the beginning of the buffer, continue to call =dabbrev--find-expansion= until all matches are found and inserted in =all-expansions=.

*** complete-with-action
complete-with-action is a helper function that handle the rest of the API so code author can focus on handling metadata, [[https://with-emacs.com/posts/tutorials/customize-completion-at-point/][see here]].

Defined in =minibuffer.el=
#+begin_quote
Signature
(complete-with-action ACTION COLLECTION STRING PREDICATE)

Documentation
Perform completion according to ACTION.

STRING, COLLECTION and PREDICATE are used as in try-completion.

If COLLECTION is a function, it will be called directly to
perform completion, no matter what ACTION is.

If ACTION is metadata or a list where the first element is
boundaries, return nil.  If ACTION is nil, this function works
like try-completion; if it is t, this function works like
all-completion; and any other value makes it work like
test-completion.
#+end_quote
