wip/dabbrev/dabbrev.md

    the last part of the function handles case to match the user-typed substring case.

    - if `dabbrev-case-replace` is falsey or `ignore-case-p` is truthy, return the candidates list as is
    - else if user-typed substring is UPCASE, upcase the candidates list
    - else if user-typed subsrtring is capitalized, capitalized the candidates list
    - else downcase the candidates list.

<a id="orgb5003af"></a>

### dabbrev&#x2013;find-all-expansions

```elisp
(defun dabbrev--find-all-expansions (abbrev ignore-case)
  "Return a list of all possible expansions of ABBREV.
If IGNORE-CASE is non-nil, accept matches which differ in case."
  (let ((all-expansions nil)
	expansion)
    (save-excursion
      (goto-char (point-min))
      (while (setq expansion (dabbrev--find-expansion abbrev -1 ignore-case))
	(setq all-expansions (cons expansion all-expansions))))
    all-expansions))
```

go to the beginning of the buffer, continue to call `dabbrev--find-expansion` until all matches are found and inserted in `all-expansions`.

<a id="org986b3fe"></a>

### complete-with-action

complete-with-action is a helper function that handle the rest of the API so code author can focus on handling metadata, [see here](https://with-emacs.com/posts/tutorials/customize-completion-at-point/).

Defined in `minibuffer.el`

> Signature (complete-with-action ACTION COLLECTION STRING PREDICATE)
>
> Documentation Perform completion according to ACTION.
>
> STRING, COLLECTION and PREDICATE are used as in try-completion.
>
> If COLLECTION is a function, it will be called directly to perform completion, no matter what ACTION is.
>
> If ACTION is metadata or a list where the first element is boundaries, return nil. If ACTION is nil, this function works like try-completion; if it is t, this function works like all-completion; and any other value makes it work like test-completion.
